html/p02-02-04-yoshii.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>演習問題と解答(02) - 乃村研Haskell勉強会2012</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="演習問題と解答(02) - 乃村研Haskell勉強会2012"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-06-25"/>
<meta name="author" content="吉井 英人"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="pub/css/text.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">演習問題と解答(02) - 乃村研Haskell勉強会2012</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">演習問題と解答(08)</a>
<ul>
<li><a href="#sec-1-1">出題範囲</a></li>
<li><a href="#sec-1-2">問題</a>
<ul>
<li><a href="#sec-1-2-1">問題1</a></li>
<li><a href="#sec-1-2-2">問題2</a></li>
<li><a href="#sec-1-2-3">問題3</a></li>
</ul>
</li>
<li><a href="#sec-1-3">解答例</a>
<ul>
<li><a href="#sec-1-3-1">解答1</a></li>
<li><a href="#sec-1-3-2">解答2</a></li>
<li><a href="#sec-1-3-3">解答3</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">演習問題と解答(08)</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">出題範囲</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>2章 I'm a list comprehension  から
</li>
<li>4章 Pattern matching まで
</li>
</ul>


<p>
    <a href="t16-13-13-nom.html">輪講資料</a>へ
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">問題</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">問題1</h4>
<div class="outline-text-4" id="text-1-2-1">

<p>      リスト内包表記を使って，以下の条件を満たす数を出力するプログラムを作成せよ．
</p><ul>
<li>1から100までの整数
</li>
<li>偶数
</li>
<li>7の倍数
</li>
</ul>

<p>      実行結果は以下の通りである．
</p>


<pre class="example">[14, 28, 42, 56, 70, 84, 98]
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">問題2</h4>
<div class="outline-text-4" id="text-1-2-2">

<p>      以下の条件をすべて満たす直角三角形の辺の長さを求める関数を作成せよ．
</p><ul>
<li>すべての辺の長さが10以下
</li>
<li>辺の長さの合計が12
</li>
</ul>

<p>      実行例以下の通りである． 
</p>


<pre class="example">ghci&gt; rightTriangle'
[(3,4,5)]
</pre>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3">問題3</h4>
<div class="outline-text-4" id="text-1-2-3">

<p>      フィボナッチ数を求めるプログラムをパターンマッチングを用いて作成せよ．
      フィボナッチ数を求める式は以下の通りである．(n番目のフィボナッチ数をF<sub>nとする．</sub>)
</p>


<pre class="example">F_0 = 0
F_1 = 1
F_n+2 = F_n + F_n+1 (n &gt; 0)
</pre>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">解答例</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1">解答1</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="example">[x | x &lt;- [1..100], even x, x `mod` 7 == 0]
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2">解答2</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="example">rightTriangles' = [(a,b,c) | c &lt;- [1..10], b &lt;- [1..c], a &lt;- [1..b], a^2 + b^2 == c^2, a+b+c == 12]
</pre>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3">解答3</h4>
<div class="outline-text-4" id="text-1-3-3">




<pre class="example">fibonacci :: (Integral a) =&gt; a -&gt; a
fibonacci 0 = 0
fibonacci 1 = 1
fibonacci n = fibonacci (n-2) + fibonacci (n-1)
</pre>

</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-06-25</p>
<p class="author">Author: 吉井 英人</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
